Tekla.Structures.Plugins.PluginBase.InputDefinition
The InputDefinition class is a class for defining the plug-in dependency over the input (points or identifiers).
The user implemented method DefineInput() of the PluginBase interface should return an array list of
input definition instances. This defines the points and identifiers the plug-in will receive as input
when the Run() method is called.

Tekla.Structures.Plugins.PluginBase.InputDefinition.#ctor(Tekla.Structures.Geometry3d.Point)
Creates a new input definition instance with one point.
Point: The point.

Tekla.Structures.Plugins.PluginBase.InputDefinition.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new input definition instance with two points.
P1: The first point.
P2: The second point.

Tekla.Structures.Plugins.PluginBase.InputDefinition.#ctor(System.Collections.ArrayList)
Creates a new input definition instance with multiple point or identifier instances.
_Input: A list of either points or identifiers.

Tekla.Structures.Plugins.PluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier)
Creates a new input definition instance with one identifier.
ID: The model object identifier.

Tekla.Structures.Plugins.PluginBase.InputDefinition.GetInputType
Returns the type of the input the current instance contains.
Returns: The type of the input.

Tekla.Structures.Plugins.PluginBase.InputDefinition.GetInput
Returns the input Tekla Structures gave to the plug-in. The input is either a point instance,
an identifier instance, an array list of points or an array list of identifiers. This is based on the input
format returned from the DefineInput() method.
Returns: The input to use in the Run() method.